Using Model Net: yolov3_tiny
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 416, 416]             448
       BatchNorm2d-2         [-1, 16, 416, 416]              32
         LeakyReLU-3         [-1, 16, 416, 416]               0
         MaxPool2d-4         [-1, 16, 208, 208]               0
            Conv2d-5         [-1, 32, 208, 208]           4,640
       BatchNorm2d-6         [-1, 32, 208, 208]              64
         LeakyReLU-7         [-1, 32, 208, 208]               0
         MaxPool2d-8         [-1, 32, 104, 104]               0
            Conv2d-9         [-1, 64, 104, 104]          18,496
      BatchNorm2d-10         [-1, 64, 104, 104]             128
        LeakyReLU-11         [-1, 64, 104, 104]               0
        MaxPool2d-12           [-1, 64, 52, 52]               0
           Conv2d-13          [-1, 128, 52, 52]          73,856
      BatchNorm2d-14          [-1, 128, 52, 52]             256
        LeakyReLU-15          [-1, 128, 52, 52]               0
        MaxPool2d-16          [-1, 128, 26, 26]               0
           Conv2d-17          [-1, 256, 26, 26]         295,168
      BatchNorm2d-18          [-1, 256, 26, 26]             512
        LeakyReLU-19          [-1, 256, 26, 26]               0
        MaxPool2d-20          [-1, 256, 13, 13]               0
           Conv2d-21          [-1, 512, 13, 13]       1,180,160
      BatchNorm2d-22          [-1, 512, 13, 13]           1,024
        LeakyReLU-23          [-1, 512, 13, 13]               0
           Conv2d-24         [-1, 1024, 13, 13]       4,719,616
      BatchNorm2d-25         [-1, 1024, 13, 13]           2,048
        LeakyReLU-26         [-1, 1024, 13, 13]               0
         BackBone-27  [[-1, 1024, 13, 13], [-1, 256, 26, 26]]               0
           Conv2d-28          [-1, 256, 13, 13]         262,400
      BatchNorm2d-29          [-1, 256, 13, 13]             512
        LeakyReLU-30          [-1, 256, 13, 13]               0
           Conv2d-31          [-1, 512, 13, 13]       1,180,160
      BatchNorm2d-32          [-1, 512, 13, 13]           1,024
        LeakyReLU-33          [-1, 512, 13, 13]               0
           Conv2d-34           [-1, 21, 13, 13]          10,773
           Conv2d-35          [-1, 128, 13, 13]          32,896
      BatchNorm2d-36          [-1, 128, 13, 13]             256
        LeakyReLU-37          [-1, 128, 13, 13]               0
         Upsample-38          [-1, 128, 26, 26]               0
           Conv2d-39          [-1, 256, 26, 26]         884,992
      BatchNorm2d-40          [-1, 256, 26, 26]             512
        LeakyReLU-41          [-1, 256, 26, 26]               0
           Conv2d-42           [-1, 21, 26, 26]           5,397
================================================================
Total params: 8,675,370
Trainable params: 8,675,370
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 1.98
Forward/backward pass size (MB): 1035.19
Params size (MB): 33.09
Estimated Total Size (MB): 1070.26



Using Model Net: yolov3_tiny_squeezenet
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 384, 960]             448
       BatchNorm2d-2         [-1, 16, 384, 960]              32
         LeakyReLU-3         [-1, 16, 384, 960]               0
         MaxPool2d-4         [-1, 16, 192, 480]               0
            Conv2d-5         [-1, 32, 192, 480]           4,640
       BatchNorm2d-6         [-1, 32, 192, 480]              64
         LeakyReLU-7         [-1, 32, 192, 480]               0
         MaxPool2d-8          [-1, 32, 96, 240]               0
            Conv2d-9          [-1, 16, 96, 240]             528
      BatchNorm2d-10          [-1, 16, 96, 240]              32
             ReLU-11          [-1, 16, 96, 240]               0
           Conv2d-12          [-1, 32, 96, 240]             544
      BatchNorm2d-13          [-1, 32, 96, 240]              64
             ReLU-14          [-1, 32, 96, 240]               0
           Conv2d-15          [-1, 32, 96, 240]           4,640
      BatchNorm2d-16          [-1, 32, 96, 240]              64
             ReLU-17          [-1, 32, 96, 240]               0
      Fire_Module-18          [-1, 64, 96, 240]               0
        MaxPool2d-19          [-1, 64, 48, 120]               0
           Conv2d-20          [-1, 32, 48, 120]           2,080
      BatchNorm2d-21          [-1, 32, 48, 120]              64
             ReLU-22          [-1, 32, 48, 120]               0
           Conv2d-23          [-1, 64, 48, 120]           2,112
      BatchNorm2d-24          [-1, 64, 48, 120]             128
             ReLU-25          [-1, 64, 48, 120]               0
           Conv2d-26          [-1, 64, 48, 120]          18,496
      BatchNorm2d-27          [-1, 64, 48, 120]             128
             ReLU-28          [-1, 64, 48, 120]               0
      Fire_Module-29         [-1, 128, 48, 120]               0
        MaxPool2d-30          [-1, 128, 24, 60]               0
           Conv2d-31           [-1, 64, 24, 60]           8,256
      BatchNorm2d-32           [-1, 64, 24, 60]             128
             ReLU-33           [-1, 64, 24, 60]               0
           Conv2d-34          [-1, 128, 24, 60]           8,320
      BatchNorm2d-35          [-1, 128, 24, 60]             256
             ReLU-36          [-1, 128, 24, 60]               0
           Conv2d-37          [-1, 128, 24, 60]          73,856
      BatchNorm2d-38          [-1, 128, 24, 60]             256
             ReLU-39          [-1, 128, 24, 60]               0
      Fire_Module-40          [-1, 256, 24, 60]               0
        MaxPool2d-41          [-1, 256, 12, 30]               0
           Conv2d-42          [-1, 128, 12, 30]          32,896
      BatchNorm2d-43          [-1, 128, 12, 30]             256
             ReLU-44          [-1, 128, 12, 30]               0
           Conv2d-45          [-1, 256, 12, 30]          33,024
      BatchNorm2d-46          [-1, 256, 12, 30]             512
             ReLU-47          [-1, 256, 12, 30]               0
           Conv2d-48          [-1, 256, 12, 30]         295,168
      BatchNorm2d-49          [-1, 256, 12, 30]             512
             ReLU-50          [-1, 256, 12, 30]               0
      Fire_Module-51          [-1, 512, 12, 30]               0
           Conv2d-52          [-1, 128, 12, 30]          65,664
      BatchNorm2d-53          [-1, 128, 12, 30]             256
             ReLU-54          [-1, 128, 12, 30]               0
           Conv2d-55          [-1, 256, 12, 30]          33,024
      BatchNorm2d-56          [-1, 256, 12, 30]             512
             ReLU-57          [-1, 256, 12, 30]               0
           Conv2d-58          [-1, 256, 12, 30]         295,168
      BatchNorm2d-59          [-1, 256, 12, 30]             512
             ReLU-60          [-1, 256, 12, 30]               0
      Fire_Module-61          [-1, 512, 12, 30]               0
         BackBone-62  [[-1, 512, 12, 30], [-1, 256, 24, 60]]               0
2019-08-28 10:39:26,566 - net_works.train_solver - INFO - Apollo Yolo Start Training...
           Conv2d-63           [-1, 64, 12, 30]          32,832
      BatchNorm2d-64           [-1, 64, 12, 30]             128
             ReLU-65           [-1, 64, 12, 30]               0
           Conv2d-66          [-1, 128, 12, 30]           8,320
      BatchNorm2d-67          [-1, 128, 12, 30]             256
             ReLU-68          [-1, 128, 12, 30]               0
           Conv2d-69          [-1, 128, 12, 30]          73,856
      BatchNorm2d-70          [-1, 128, 12, 30]             256
             ReLU-71          [-1, 128, 12, 30]               0
      Fire_Module-72          [-1, 256, 12, 30]               0
           Conv2d-73          [-1, 128, 12, 30]          32,896
      BatchNorm2d-74          [-1, 128, 12, 30]             256
             ReLU-75          [-1, 128, 12, 30]               0
           Conv2d-76          [-1, 256, 12, 30]          33,024
      BatchNorm2d-77          [-1, 256, 12, 30]             512
             ReLU-78          [-1, 256, 12, 30]               0
           Conv2d-79          [-1, 256, 12, 30]         295,168
      BatchNorm2d-80          [-1, 256, 12, 30]             512
             ReLU-81          [-1, 256, 12, 30]               0
      Fire_Module-82          [-1, 512, 12, 30]               0
           Conv2d-83           [-1, 21, 12, 30]          10,773
           Conv2d-84           [-1, 32, 12, 30]           8,224
      BatchNorm2d-85           [-1, 32, 12, 30]              64
             ReLU-86           [-1, 32, 12, 30]               0
           Conv2d-87           [-1, 64, 12, 30]           2,112
      BatchNorm2d-88           [-1, 64, 12, 30]             128
             ReLU-89           [-1, 64, 12, 30]               0
           Conv2d-90           [-1, 64, 12, 30]          18,496
      BatchNorm2d-91           [-1, 64, 12, 30]             128
             ReLU-92           [-1, 64, 12, 30]               0
      Fire_Module-93          [-1, 128, 12, 30]               0
         Upsample-94          [-1, 128, 24, 60]               0
           Conv2d-95           [-1, 64, 24, 60]          24,640
      BatchNorm2d-96           [-1, 64, 24, 60]             128
             ReLU-97           [-1, 64, 24, 60]               0
           Conv2d-98          [-1, 128, 24, 60]           8,320
      BatchNorm2d-99          [-1, 128, 24, 60]             256
            ReLU-100          [-1, 128, 24, 60]               0
          Conv2d-101          [-1, 128, 24, 60]          73,856
     BatchNorm2d-102          [-1, 128, 24, 60]             256
            ReLU-103          [-1, 128, 24, 60]               0
     Fire_Module-104          [-1, 256, 24, 60]               0
          Conv2d-105           [-1, 21, 24, 60]           5,397
================================================================
Total params: 1,513,434
Trainable params: 1,513,434
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 4.22
Forward/backward pass size (MB): 6245.92
Params size (MB): 5.77
Estimated Total Size (MB): 6255.91
----------------------------------------------------------------
  + Number of params: 1.51M


Using Model Net: yolov3_tiny_mobilenet
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 384, 960]             448
       BatchNorm2d-2         [-1, 16, 384, 960]              32
         LeakyReLU-3         [-1, 16, 384, 960]               0
         MaxPool2d-4         [-1, 16, 192, 480]               0
            Conv2d-5         [-1, 16, 192, 480]             144
       BatchNorm2d-6         [-1, 16, 192, 480]              32
             ReLU6-7         [-1, 16, 192, 480]               0
            Conv2d-8         [-1, 32, 192, 480]             512
       BatchNorm2d-9         [-1, 32, 192, 480]              64
            ReLU6-10         [-1, 32, 192, 480]               0
        MaxPool2d-11          [-1, 32, 96, 240]               0
           Conv2d-12          [-1, 32, 96, 240]             288
      BatchNorm2d-13          [-1, 32, 96, 240]              64
            ReLU6-14          [-1, 32, 96, 240]               0
           Conv2d-15          [-1, 64, 96, 240]           2,048
      BatchNorm2d-16          [-1, 64, 96, 240]             128
            ReLU6-17          [-1, 64, 96, 240]               0
        MaxPool2d-18          [-1, 64, 48, 120]               0
           Conv2d-19          [-1, 64, 48, 120]             576
      BatchNorm2d-20          [-1, 64, 48, 120]             128
            ReLU6-21          [-1, 64, 48, 120]               0
           Conv2d-22         [-1, 128, 48, 120]           8,192
      BatchNorm2d-23         [-1, 128, 48, 120]             256
            ReLU6-24         [-1, 128, 48, 120]               0
        MaxPool2d-25          [-1, 128, 24, 60]               0
           Conv2d-26          [-1, 128, 24, 60]           1,152
      BatchNorm2d-27          [-1, 128, 24, 60]             256
            ReLU6-28          [-1, 128, 24, 60]               0
           Conv2d-29          [-1, 256, 24, 60]          32,768
      BatchNorm2d-30          [-1, 256, 24, 60]             512
            ReLU6-31          [-1, 256, 24, 60]               0
        MaxPool2d-32          [-1, 256, 12, 30]               0
           Conv2d-33          [-1, 256, 12, 30]           2,304
      BatchNorm2d-34          [-1, 256, 12, 30]             512
            ReLU6-35          [-1, 256, 12, 30]               0
           Conv2d-36          [-1, 512, 12, 30]         131,072
      BatchNorm2d-37          [-1, 512, 12, 30]           1,024
            ReLU6-38          [-1, 512, 12, 30]               0
           Conv2d-39          [-1, 512, 12, 30]           4,608
      BatchNorm2d-40          [-1, 512, 12, 30]           1,024
            ReLU6-41          [-1, 512, 12, 30]               0
           Conv2d-42          [-1, 512, 12, 30]         262,144
      BatchNorm2d-43          [-1, 512, 12, 30]           1,024
            ReLU6-44          [-1, 512, 12, 30]               0
         BackBone-45  [[-1, 512, 12, 30], [-1, 256, 24, 60]]               0
           Conv2d-46          [-1, 512, 12, 30]             512
      BatchNorm2d-47          [-1, 512, 12, 30]           1,024
            ReLU6-48          [-1, 512, 12, 30]               0
           Conv2d-49          [-1, 256, 12, 30]         131,072
      BatchNorm2d-50          [-1, 256, 12, 30]             512
            ReLU6-51          [-1, 256, 12, 30]               0
           Conv2d-52          [-1, 256, 12, 30]           2,304
      BatchNorm2d-53          [-1, 256, 12, 30]             512
            ReLU6-54          [-1, 256, 12, 30]               0
           Conv2d-55          [-1, 512, 12, 30]         131,072
      BatchNorm2d-56          [-1, 512, 12, 30]           1,024
            ReLU6-57          [-1, 512, 12, 30]               0
           Conv2d-58           [-1, 21, 12, 30]          10,773
           Conv2d-59          [-1, 256, 12, 30]             256
      BatchNorm2d-60          [-1, 256, 12, 30]             512
            ReLU6-61          [-1, 256, 12, 30]               0
           Conv2d-62          [-1, 128, 12, 30]          32,768
      BatchNorm2d-63          [-1, 128, 12, 30]             256
            ReLU6-64          [-1, 128, 12, 30]               0
         Upsample-65          [-1, 128, 24, 60]               0
           Conv2d-66          [-1, 384, 24, 60]           3,456
      BatchNorm2d-67          [-1, 384, 24, 60]             768
            ReLU6-68          [-1, 384, 24, 60]               0
           Conv2d-69          [-1, 256, 24, 60]          98,304
      BatchNorm2d-70          [-1, 256, 24, 60]             512
            ReLU6-71          [-1, 256, 24, 60]               0
           Conv2d-72           [-1, 21, 24, 60]           5,397
================================================================
Total params: 872,346
Trainable params: 872,346
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 4.22
Forward/backward pass size (MB): 6288.01
Params size (MB): 3.33
Estimated Total Size (MB): 6295.56
----------------------------------------------------------------
  + Number of params: 0.87M

Using Model Net: yolov3_tiny_shufflenet
Backend TkAgg is interactive backend. Turning interactive mode on.
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 384, 960]             448
       BatchNorm2d-2         [-1, 16, 384, 960]              32
         LeakyReLU-3         [-1, 16, 384, 960]               0
         MaxPool2d-4         [-1, 16, 192, 480]               0
            Conv2d-5          [-1, 8, 192, 480]              32
       BatchNorm2d-6          [-1, 8, 192, 480]              16
              ReLU-7          [-1, 8, 192, 480]               0
            Conv2d-8          [-1, 8, 192, 480]              72
       BatchNorm2d-9          [-1, 8, 192, 480]              16
           Conv2d-10         [-1, 32, 192, 480]              64
      BatchNorm2d-11         [-1, 32, 192, 480]              64
ShuffleBottleneck-12         [-1, 32, 192, 480]               0
        MaxPool2d-13          [-1, 32, 96, 240]               0
           Conv2d-14          [-1, 16, 96, 240]             128
      BatchNorm2d-15          [-1, 16, 96, 240]              32
             ReLU-16          [-1, 16, 96, 240]               0
           Conv2d-17          [-1, 16, 96, 240]             144
      BatchNorm2d-18          [-1, 16, 96, 240]              32
           Conv2d-19          [-1, 64, 96, 240]             256
      BatchNorm2d-20          [-1, 64, 96, 240]             128
ShuffleBottleneck-21          [-1, 64, 96, 240]               0
        MaxPool2d-22          [-1, 64, 48, 120]               0
           Conv2d-23          [-1, 32, 48, 120]             512
      BatchNorm2d-24          [-1, 32, 48, 120]              64
             ReLU-25          [-1, 32, 48, 120]               0
           Conv2d-26          [-1, 32, 48, 120]             288
      BatchNorm2d-27          [-1, 32, 48, 120]              64
           Conv2d-28         [-1, 128, 48, 120]           1,024
      BatchNorm2d-29         [-1, 128, 48, 120]             256
ShuffleBottleneck-30         [-1, 128, 48, 120]               0
        MaxPool2d-31          [-1, 128, 24, 60]               0
           Conv2d-32           [-1, 64, 24, 60]           2,048
      BatchNorm2d-33           [-1, 64, 24, 60]             128
             ReLU-34           [-1, 64, 24, 60]               0
           Conv2d-35           [-1, 64, 24, 60]             576
      BatchNorm2d-36           [-1, 64, 24, 60]             128
           Conv2d-37          [-1, 256, 24, 60]           4,096
      BatchNorm2d-38          [-1, 256, 24, 60]             512
ShuffleBottleneck-39          [-1, 256, 24, 60]               0
        MaxPool2d-40          [-1, 256, 12, 30]               0
           Conv2d-41          [-1, 128, 12, 30]           8,192
      BatchNorm2d-42          [-1, 128, 12, 30]             256
             ReLU-43          [-1, 128, 12, 30]               0
           Conv2d-44          [-1, 128, 12, 30]           1,152
      BatchNorm2d-45          [-1, 128, 12, 30]             256
           Conv2d-46          [-1, 512, 12, 30]          16,384
      BatchNorm2d-47          [-1, 512, 12, 30]           1,024
ShuffleBottleneck-48          [-1, 512, 12, 30]               0
           Conv2d-49          [-1, 128, 12, 30]          16,384
      BatchNorm2d-50          [-1, 128, 12, 30]             256
             ReLU-51          [-1, 128, 12, 30]               0
           Conv2d-52          [-1, 128, 12, 30]           1,152
      BatchNorm2d-53          [-1, 128, 12, 30]             256
           Conv2d-54          [-1, 512, 12, 30]          16,384
      BatchNorm2d-55          [-1, 512, 12, 30]           1,024
ShuffleBottleneck-56          [-1, 512, 12, 30]               0
         BackBone-57  [[-1, 512, 12, 30], [-1, 256, 24, 60]]               0
           Conv2d-58           [-1, 64, 12, 30]           8,192
      BatchNorm2d-59           [-1, 64, 12, 30]             128
             ReLU-60           [-1, 64, 12, 30]               0
           Conv2d-61           [-1, 64, 12, 30]             576
      BatchNorm2d-62           [-1, 64, 12, 30]             128
           Conv2d-63          [-1, 256, 12, 30]           4,096
      BatchNorm2d-64          [-1, 256, 12, 30]             512
ShuffleBottleneck-65          [-1, 256, 12, 30]               0
           Conv2d-66          [-1, 128, 12, 30]           8,192
      BatchNorm2d-67          [-1, 128, 12, 30]             256
             ReLU-68          [-1, 128, 12, 30]               0
           Conv2d-69          [-1, 128, 12, 30]           1,152
      BatchNorm2d-70          [-1, 128, 12, 30]             256
           Conv2d-71          [-1, 512, 12, 30]          16,384
      BatchNorm2d-72          [-1, 512, 12, 30]           1,024
ShuffleBottleneck-73          [-1, 512, 12, 30]               0
           Conv2d-74           [-1, 21, 12, 30]          10,773
           Conv2d-75           [-1, 32, 12, 30]           2,048
      BatchNorm2d-76           [-1, 32, 12, 30]              64
             ReLU-77           [-1, 32, 12, 30]               0
           Conv2d-78           [-1, 32, 12, 30]             288
      BatchNorm2d-79           [-1, 32, 12, 30]              64
           Conv2d-80          [-1, 128, 12, 30]           1,024
      BatchNorm2d-81          [-1, 128, 12, 30]             256
ShuffleBottleneck-82          [-1, 128, 12, 30]               0
         Upsample-83          [-1, 128, 24, 60]               0
           Conv2d-84           [-1, 64, 24, 60]           6,144
      BatchNorm2d-85           [-1, 64, 24, 60]             128
             ReLU-86           [-1, 64, 24, 60]               0
           Conv2d-87           [-1, 64, 24, 60]             576
      BatchNorm2d-88           [-1, 64, 24, 60]             128
           Conv2d-89          [-1, 256, 24, 60]           4,096
      BatchNorm2d-90          [-1, 256, 24, 60]             512
ShuffleBottleneck-91          [-1, 256, 24, 60]               0
           Conv2d-92           [-1, 21, 24, 60]           5,397
================================================================
Total params: 146,274
Trainable params: 146,274
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 4.22
Forward/backward pass size (MB): 6260.15
Params size (MB): 0.56
Estimated Total Size (MB): 6264.93
----------------------------------------------------------------
  + Number of params: 0.15M